Revit 2027 API
PanelScheduleView.GetSlotNumberByCell Method
 Gets the slot number in the circuit table
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetSlotNumberByCell(
	int nRow,
	int nCol
)
Public Function GetSlotNumberByCell (
	nRow As Integer,
	nCol As Integer
) As Integer
public:
int GetSlotNumberByCell(
	int nRow,
	int nCol
)
member GetSlotNumberByCell :
        nRow : int *
        nCol : int -> int
Parameters
nRow Int32
 Column Number
nCol Int32
Return Value
Int32
 Row Number
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace